In [2]:
import pandas as pd

PANDAS DATA STRUCTURE

In [3]:
#SERIES

s1 = pd.Series([11,22,33,44,55,66,77,88,99,110,"midha",0.4])
s1 #pandas series object (it returns index also)

0        11
1        22
2        33
3        44
4        55
5        66
6        77
7        88
8        99
9       110
10    midha
11      0.4
dtype: object

In [4]:
s1[9] #accessing value by index

110

In [5]:
s1[[2,3,0,8]] #it accepts parameter as a bunch

2    33
3    44
0    11
8    99
dtype: object

In [6]:
s1[5] = 87 #modifying value in series
#s1[5.1] = 87 is also possible

In [7]:
s1[[1,2,3,4]] = [23,33,45,67] #modyfying multiple values

In [8]:
del s1[5] #deleting a value in series (multiple del is not working)

In [9]:
s1

0        11
1        23
2        33
3        45
4        67
6        77
7        88
8        99
9       110
10    midha
11      0.4
dtype: object

In [10]:
s1[12] = 34  #insert in a series with a new index

In [11]:
s1

0        11
1        23
2        33
3        45
4        67
6        77
7        88
8        99
9       110
10    midha
11      0.4
12       34
dtype: object

In [12]:
s2 = pd.Series([10,20,30,40], index = ["oranges","apples","bananas","kiwi"])

In [13]:
s2.index

Index(['oranges', 'apples', 'bananas', 'kiwi'], dtype='object')

In [14]:
s2

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [15]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [16]:
ourindex = ["oranges","apples","bananas","kiwi"]

In [17]:
s3 = pd.Series([10,20,30,40],index = ourindex)

In [18]:
s3

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [19]:
#index cannot be modified

In [20]:
s3>30

oranges    False
apples     False
bananas    False
kiwi        True
dtype: bool

In [21]:
s3[s3>30]

kiwi    40
dtype: int64

In [22]:
"oranges" in s3

True

In [23]:
"peech" in s3

False

In [24]:
obj = pd.Series([3,8,1,7,9,4])
obj.rank() #ranking ghr jakr dekhna hai

0    2.0
1    5.0
2    1.0
3    4.0
4    6.0
5    3.0
dtype: float64

CREATING A SERIES BY USING DICTIONARY

In [25]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data = pd.Series(sdata)
data

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states = ["california","Ohio","Texas","Oregon"]
data1 = pd.Series(sdata, index = states)
data1 #ohio,Texas,Oregon uper b hai to inki values dedi , california ki value nhi di coz uper nhi hai ,
#jabky utah cut krdia q k yeh idhar ab nhi dia

california        NaN
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
dtype: float64

In [27]:
#data1["california"] = 567 #ab NaN ki jgh naye value assign krdi

In [28]:
data1

california        NaN
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
dtype: float64

data1.isnull() #ab data bht hoga to agr null find krna ho NaN tou isnull() ka function lagaengy

In [29]:
data1.notnull() #jo null nhi hon wo ajaen

california    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

# DATA FRAMES

In [30]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
#values ki counting same honi chye

In [31]:
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [33]:
myself = {'friends': ['sabika','warda','zehra','amna','mariam'],
         'fname': ['taqvi','rehan','sadia','mujahid','naz'],
          'age' : [21,20,20,20,19],}
mydata = pd.DataFrame(myself)
mydata

  friends    fname  age
0  sabika    taqvi   21
1   warda    rehan   20
2   zehra    sadia   20
3    amna  mujahid   20
4  mariam      naz   19

In [34]:
type(df1)

pandas.core.frame.DataFrame

In [35]:
df1.shape

(6, 3)

In [36]:
df1['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [37]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [38]:
df1[['pop','state']]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [39]:
del df1["pop"] #deleting a column

In [40]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [41]:
df1["debt"] = [100,200,300,400,500,600]
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   200
2    Ohio  2002   300
3  Nevada  2001   400
4  Nevada  2002   500
5  Nevada  2003   600

In [42]:
df1['debt'] = range(6)
df1

    state  year  debt
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4
5  Nevada  2003     5

In [43]:
df1['debt'] = df1['state']
df1

    state  year    debt
0    Ohio  2000    Ohio
1    Ohio  2001    Ohio
2    Ohio  2002    Ohio
3  Nevada  2001  Nevada
4  Nevada  2002  Nevada
5  Nevada  2003  Nevada

In [44]:
dic = {
    "Ai for EO": [78,89,98,90,87,86],
    "Python 1" : [12,29,58,59,88,89],
    "Python 2" : [12,23,55,87,97,89],
}
df = pd.DataFrame(dic,index = ["Nasir","Asad","Ramsha","Mansoor","Saba","Hina"])
df

         Ai for EO  Python 1  Python 2
Nasir           78        12        12
Asad            89        29        23
Ramsha          98        58        55
Mansoor         90        59        87
Saba            87        88        97
Hina            86        89        89

In [45]:
df['total_marks'] = df["Ai for EO"] + df["Python 1"] + df["Python 2"]
df

         Ai for EO  Python 1  Python 2  total_marks
Nasir           78        12        12          102
Asad            89        29        23          141
Ramsha          98        58        55          211
Mansoor         90        59        87          236
Saba            87        88        97          272
Hina            86        89        89          264

In [46]:
df['total_marks']

Nasir      102
Asad       141
Ramsha     211
Mansoor    236
Saba       272
Hina       264
Name: total_marks, dtype: int64

In [47]:
df['criteria'] = df['total_marks']>200

In [48]:
df

         Ai for EO  Python 1  Python 2  total_marks  criteria
Nasir           78        12        12          102     False
Asad            89        29        23          141     False
Ramsha          98        58        55          211      True
Mansoor         90        59        87          236      True
Saba            87        88        97          272      True
Hina            86        89        89          264      True

In [49]:
df['criteria'] = ["Pass" if marks>200 else "Fails" for marks in df.total_marks]
df

         Ai for EO  Python 1  Python 2  total_marks criteria
Nasir           78        12        12          102    Fails
Asad            89        29        23          141    Fails
Ramsha          98        58        55          211     Pass
Mansoor         90        59        87          236     Pass
Saba            87        88        97          272     Pass
Hina            86        89        89          264     Pass

In [50]:
df['percentage'] = df["total_marks"] / 300 *100

In [51]:
df['status'] = ["Pass" if a>=33 and p1>=33 and p2>=33 else "Fails" for a,p1,p2 in zip(df["Ai for EO"],df["Python 1"],df["Python 2"])]
df

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [52]:
a = list(range(5))
b = list(range(1,6))
print(a)
print(b)
c = zip(a,b)
for i in c:
    print(i)

[0, 1, 2, 3, 4]
[1, 2, 3, 4, 5]
(0, 1)
(1, 2)
(2, 3)
(3, 4)
(4, 5)

In [53]:
df.head() #by default it returns 5 data

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass

In [54]:
df.head(3) #we can define also how many to return

        Ai for EO  Python 1  Python 2  total_marks criteria  percentage status
Nasir          78        12        12          102    Fails   34.000000  Fails
Asad           89        29        23          141    Fails   47.000000  Fails
Ramsha         98        58        55          211     Pass   70.333333   Pass

In [55]:
df.tail() #last five data returns

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [56]:
df.tail(6)

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [57]:
df.loc["Hina"]

Ai for EO        86
Python 1         89
Python 2         89
total_marks     264
criteria       Pass
percentage       88
status         Pass
Name: Hina, dtype: object

In [58]:
df.loc["Asad":"Hina"] #hina is also inclusive

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [59]:
df.iloc[0] #by default indexing hai mojod kahin

Ai for EO         78
Python 1          12
Python 2          12
total_marks      102
criteria       Fails
percentage        34
status         Fails
Name: Nasir, dtype: object

In [60]:
df.iloc[0:3] #3 is exclusive here

        Ai for EO  Python 1  Python 2  total_marks criteria  percentage status
Nasir          78        12        12          102    Fails   34.000000  Fails
Asad           89        29        23          141    Fails   47.000000  Fails
Ramsha         98        58        55          211     Pass   70.333333   Pass

In [61]:
df.loc['Nasir']['Python 2']

12

In [62]:
df.loc["midha"] = [96,96,93,100,"Pass",93.33,"Pass"]

In [63]:
df

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass
midha,96,96,93,100,Pass,93.330000,Pass

In [64]:
df.iloc[::-1]

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
midha,96,96,93,100,Pass,93.330000,Pass
Hina,86,89,89,264,Pass,88.000000,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Ramsha,98,58,55,211,Pass,70.333333,Pass
Asad,89,29,23,141,Fails,47.000000,Fails
Nasir,78,12,12,102,Fails,34.000000,Fails